[{"definition":"The only [country] keeping [penguins] from coquering [the Earth]","word":"USA","created_at":"2008-04-08T00:00:00.000Z","updated_at":"2008-04-08T00:00:00.000Z","example":"If it weren't for [the USA], [penguins] would have [destroyed] humans long ago."},{"definition":"that [land] [mass] between canada and [mexico]","word":"USA","created_at":"2006-11-05T00:00:00.000Z","updated_at":"2006-11-05T00:00:00.000Z","example":"go look at a [map] [the USA] is hard to miss its [pretty damn] big like alot of its people"},{"definition":"[The world's] punch-bag.","word":"usa","created_at":"2004-02-10T00:00:00.000Z","updated_at":"2004-02-10T00:00:00.000Z","example":"\"man, i feel so [angry] today.*goes to urbandictionay.[com] and [types] an anti-us definition for usa*\""},{"definition":"A country which people base their views off of based on a few [dumbasses]. We have both bad and good, just like any other place in the world. People feel the need to [bash on] us because they met one American who was an asshole or they base us all of [George Bush].\n\nWe have a lot of people. Don't stereotype us all into one group.","word":"USA","created_at":"2009-12-24T00:00:00.000Z","updated_at":"2009-12-24T00:00:00.000Z","example":"Person A: Hey, what's it like in USA?\r\nPerson B: Well, we have our [fair] share of [dumbasses], but we also have many very intelligent people too. There are some [rednecks], but not all of us are."},{"definition":"1.) A country of immigrants. Though some of the citizens like to forget that.\n\n2.) The proverbial [punching bag] for the rest of the world. Other countries like to use anecdotal evidence of fifteen year olds and random old hicks on the street as evidence that we're all a bunch of fat, ignorant cows.\n\n3.) Admittedly, some of the worst choices in elected representatives (i.e. [GWB]) with a slight [fetishism] for religion unseen in the rest of the western world.","word":"USA","created_at":"2011-06-23T00:00:00.000Z","updated_at":"2011-06-23T00:00:00.000Z","example":"1.) \"Man, we need to get all these fuckin' immigrants out of our country.\"\r\n\"Yeah, my forefathers didn't travel miles here, so a bunch of immigrants could overrun the USA\"\n\n2.) \"Americans are so dumb. Look at them running around with their obesity problem without using [the metric system]. I met this thirteen year old American once and she didn't even understand the complexities of the situation in [Libya]!! Obviously we are the intellectually superior nation\"\n\n3.)\"They [misunderestimated] me.\" - George W. Bush"},{"definition":"Stands for United States of America.  Was initially a colonial territory of Great Britain before declaring [independance] in 1776.  Initially founded on the principle that a central government should only exist to provide security to its people and its borders without intruding on personal freedom and civil liberties.  Government was to be focused more on the individual states' powers rather than that of federal ones.  Certain [recent events] probably have the Founding Fathers turning over in their graves, as the great nation they created slowly degenerates into a [Police State]; something they feared greatly and took great measures to write the Constitution to prevent it.  Unfortunately, when the majority of the citizens, and the government, ignore the Constitution, it doesn't help much.","word":"USA","created_at":"2004-06-29T00:00:00.000Z","updated_at":"2004-06-29T00:00:00.000Z","example":"While America certainly is full of ignorant and/or rude assholes, there are still plenty of honest, good, [independant] thinkers.  Of course, many of us are planning to leave the country.  To all those that [bash] Americans, please remember that not all of us are awful and many of us think the same way you do - have [gripes] with our government, but not solely with us."},{"definition":"the country where [i live], [run by] a stupid f*ckhead and is going to [shite].","word":"usa","created_at":"2007-08-22T00:00:00.000Z","updated_at":"2007-08-22T00:00:00.000Z","example":"\"[i live] in [the usa], but im moving when i'm [old enough].\""},{"definition":"A country that [regards] itself as [the greatest] in the world but only 10% of [americans] have passports. How would they know then?","word":"usa","created_at":"2007-04-02T00:00:00.000Z","updated_at":"2007-04-02T00:00:00.000Z","example":"Are you [going to Europe] on holiday or [the USA]? Where's [Europe]?"},{"definition":"A country with a hugely negative connotation to its name amongst the peoples of the world. A country thats reputation has been completely ruined and shot down by George W. Bush, and even in part by Ronald Reagan, even if he was ten times the president Bush will ever be. A country that is basically %10 retards, %90 good, wholesome people. A country with MANY accents, not just one loud and annoying one. Spanish, Jersey, New York, Boston, Northwestern, Northeastern, Southern, Indian, Middle-Eastern (as in, the Middle East, other side of the globe,) Mid-Western, all these types of accents and more. So don't bother assuming we all have the same accents. I know there are many variations of accents in the U.K. I know there are differences in Australian accents. I know the difference between the U.K, Britain, and England. So do a lot of people who inhabit the U.S.A. We're not all a bunch of self-righteous pricks who go parading around exclaiming our superiority out of every country in the world. Approximately %15 percent of us support our moronic President, and only about %10 of us support our horrific Congress. Did you get that? NOT ALL OF US SUPPORT OUR GOVERNMENT.\r\n\r\nYes, our measuring system is different from the worlds. Haha, guess what, we're not the only country who has a different system. Will you tell the kids in our schools that they are \"learning wrong\" and are \"[fucking idiots]\"? I don't think so. You say we spell wrong. We don't add [u's] to a lot of our words. Just because we're different doesn't mean we're wrong and stupid, and before you say \"dat iz how dey orignaily [rote] [stuffz] wen english wuz cretaed!1\" then [so be it]. Many things have started out as one big thing and then things change. Take, I don't know, the Catholic Church. Different branches of religion. Will you call everybody but Catholics \"wrong\" because they don't do it \"the original way?\" Nope.\r\n\r\nIt is a country sans-racism in most parts. It is a country full of loving, helping people. It is a country of educated, creative, and insightful people. It is a very diverse country with probably every culture from around the world mingled into our big ol' [melting pot] of a country. It is a country that understands that the rest of the world is NOT full of smelly, [snooty] people. We understand that South America does not equal \"Jungle wasteland with monkeys and tall [amazonian] [womenz].\" We understand that Europe is not only inhabited by \"snobby pricks with weird accents who hate america\" (Admittedly, a nice chunk of Europe hates us.) We understand that Asia is a) Not a country, and b) Not consisting of \"a bunch of slanty-eyed funny-accented math geeks.\"\r\n\r\nWe are not an ignorant people. Before you say \"but ur [newz] stationz only sho u guyz newz corresponding to UR [CUNTRY]!111,\" we are well aware of that. We know [what goes on] in the world for the most part, thanks to the Internet and BBC America. We don't think of the French as smelly, nor of the English as snooty, nor of Australians as good surfers, nor of Asians as dorks, nor of Muslims as terrorists, nor of Brazilians as good [soccer players], nor of Latinos as drug-smugglers who make spicy food, nor of Canadians as backwards liberalists, nor of Russians as [commies], nor of Africans as aids-ridden [mites], no matter what anybody else says. Yes we have our share of ignorant people who think like that, but are you going to tell me that America is the ONLY COUNTRY that has people who think like this? Not likely.\r\n\r\nIf our government is in the [Middle-East] for oil, that is our government, and NOT us, the populace. If our government [plotted] against us in [the 9/11] attacks, that is our GOVERNMENT, not the populace. If our government takes people from other nations and torture them, that is our GOVERNMENT, and NOT us. If our government keeps sending countless amounts of men and women into the Middle-East for an [oil war], that is, again, our GOVERNMENT, AND NOT US.\r\n\r\nIf you have encountered a stupid American traveling to [your country], then don't let that be the only example of American that you use. I've met countless of ignorant British, Australian, French, Canadian tourists, but I know that they THEMSELVES are stupid, and NOT the people they represent.\r\n\r\nWe have great athletes, we have great schools,(Our public, PUBLIC, [education system] is bad, but we have some of the finest universities in the world.) we have wonderful artists, we have good businessmen/women. We have good and bad, just like [YOUR country] has good and bad.\r\n\r\nMost of us love the world and its cultures. Most of the world hates us and our culture. As if we only had one definitive culture.\r\n\r\nIf [you hate America], then you are an [ignorant prick]. I feel sorry for you. I will NEVER hate an entire people based on the actions of one group or one part of them. [Get your act together].","word":"usa","created_at":"2008-02-16T00:00:00.000Z","updated_at":"2008-02-16T00:00:00.000Z","example":"I am an American, and I am damned proud of it. I respect your countries and [cultures], and [god damn it], I want respect in return. I love this country and what it stands for, and I hate my [government]. I am educated and culturally aware. I am caring and respectful. I am an American.\r\nI am from the USA."},{"definition":"[Short] for [United States of America].\r\nSee [America]","word":"USA","created_at":"2004-12-11T00:00:00.000Z","updated_at":"2004-12-11T00:00:00.000Z","example":"Person 1: [Do you] know what \"USA\" means?\r\n[Person 2]: Yeah, it means [United States of America]."}]